Project/Toir/src/DataProcessors/РедактированиеКлассов/РедактированиеКлассов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеКлассов</name>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogObject.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаРодителя</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
        <types>CatalogRef.ВложенныеАтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусНаследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАтрибутаКласса</name>
      <type>
        <types>Characteristic.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАтрибутаКлассаСоставное</name>
      <type>
        <types>CatalogRef.ОбъектыНоменклатуры</types>
        <types>CatalogRef.Классы</types>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимИспользования</name>
      <type>
        <types>EnumRef.РежимыИспользованияАтрибутов</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимЗаполнения</name>
      <type>
        <types>EnumRef.РежимыЗаполненияАтрибутов</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимЗаполненияРодителя</name>
      <type>
        <types>EnumRef.РежимыЗаполненияАтрибутов</types>
      </type>
    </attributes>
    <attributes>
      <name>МножественноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МножественноеЗначениеКартинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокДоступныхЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СписокДоступныхЗначенийПереключатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинЗначение</name>
      <type>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксЗначение</name>
      <type>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЗначений</name>
      <type>
        <types>CatalogRef.Классы</types>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборАтрибутов</name>
      <type>
        <types>CatalogRef.НаборыАтрибутов</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НуженИсточникЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставнойТипЗначения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассТабличнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЗаполнения</name>
      <type>
        <types>CatalogRef.ШаблоныЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлениеСтрокТабЧастиВНоменклатуреКласса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияСписочныхАтрибутов</name>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАтрибутаКласса</name>
      <type>
        <types>Characteristic.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусНаследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуемоеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеЗначениеНаследуемое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтрокиТабличныхАтрибутов</name>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтрокиРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусНаследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЗначений</name>
      <type>
        <types>CatalogRef.Классы</types>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКласса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектыНоменклатуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАтрибутаКласса</name>
      <type>
        <types>Characteristic.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияТабличныхАтрибутов</name>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>АтрибутТаблицы</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
        <types>CatalogRef.ВложенныеАтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАтрибутаТаблицы</name>
      <type>
        <types>Characteristic.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтрокиРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/DataProcessors/РедактированиеКлассов/Forms/ФормаВыборкаСоставногоЗначения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоТипов = 1;
	ТекЗначение = Неопределено;
	Если НЕ Параметры.Свойство("КоличествоТипов", КоличествоТипов) Тогда
		КоличествоТипов = 3;
	КонецЕсли;
	ВыбранныеЗначения = 0;
	ТекВладелец = Неопределено;
	
	Если Параметры.Свойство("Ключ", ТекЗначение) Тогда
		СписокВыбранных = Элементы.ВыбранныеЗначения.СписокВыбора;
		СписокВыбранных.Очистить();
		// Объект номенклатуры.
		Если ЗначениеЗаполнено(ТекЗначение) И ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.ОбъектыНоменклатуры") Тогда
			СписокВыбранных.Добавить(2, Строка(ТекЗначение));
			Элементы.СписокОбъектовНоменклатуры.ТекущаяСтрока = ТекЗначение;
			ТекЗначение = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекЗначение, "НоменклатураКласса");
			ТекВладелец = ТекЗначение;
			УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
				СписокОбъектовНоменклатуры, "НоменклатураКласса", ТекВладелец,,, Истина);
			ВыбранныеЗначения = 2;
		КонецЕсли;
		// Номенклатура класса.
		Если ЗначениеЗаполнено(ТекЗначение) И ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.НоменклатураКласса") Тогда
			СписокВыбранных.Вставить(0, 1, Строка(ТекЗначение)); 
			Элементы.СписокНоменклатуры.ТекущаяСтрока = ТекЗначение;
			ТекЗначение = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекЗначение, "Класс");
			Если ВыбранныеЗначения = 0 Тогда
				ТекВладелец = ТекЗначение;
				ВыбранныеЗначения = 1;
				УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
					СписокНоменклатуры, "Класс", ТекВладелец,,, Истина);
			КонецЕсли;
		КонецЕсли;
		// Класс.
		Если ТипЗнч(ТекЗначение) = Тип("СправочникСсылка.Классы") ИЛИ НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
			ПредставлениеЗначения = ?(ЗначениеЗаполнено(ТекЗначение), Строка(ТекЗначение), НСтр("ru='(Выберите класс)'"));
			СписокВыбранных.Вставить(0, 0, ПредставлениеЗначения); 
			Если ЗначениеЗаполнено(ТекЗначение) Тогда
				Элементы.СписокКлассов.ТекущаяСтрока = ТекЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбранныеЗначенияПриИзменении(Элемент)
	
	ПерейтиНаУровеньВыше();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокКлассов

&НаКлиенте
Процедура СписокКлассовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписокОбъектовНоменклатуры

&НаКлиенте
Процедура СписокОбъектовНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЗнаениеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьВыбор(Команда)
	
	ВыбратьЗнаениеНаКлиенте(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ВыбратьЗнаениеНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьЗнаениеНаКлиенте(ЗавершитьВыбор=Ложь)
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	ТекЗначение = ТекЭлементы.СписокВыбора.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗавершитьВыбор ИЛИ ВыбранныеЗначения = КоличествоТипов - 1 Тогда
		ОповеститьОВыборе(ТекЗначение);
	Иначе
		ВыбратьЗначениеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьЗначениеНаСервере()
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	ТекЗначение = ТекЭлементы.СписокВыбора.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеЗначения = 0 Тогда
		РеквизитыКласса = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			ТекЗначение, "НоменклатураКласса, ОбъектыНоменклатуры");
		Если КоличествоТипов = 3 И НЕ РеквизитыКласса.ОбъектыНоменклатуры Тогда
			Возврат;
		ИначеЕсли КоличествоТипов = 2 И НЕ РеквизитыКласса.НоменклатураКласса Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВыбранныеЗначения.СписокВыбора;
	СписокВыбора[ВыбранныеЗначения].Представление = Строка(ТекЗначение);
	
	ВыбранныеЗначения = ВыбранныеЗначения + 1;
	
	ТекВладелец = ТекЗначение;
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	
	УправлениеНСИФункцииКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтаФорма[ТекЭлементы.СписокВыбора.ПутьКДанным], ТекЭлементы.ПолеОтбора, ТекВладелец, , , Истина);
	
	СписокВыбора.Добавить(ВыбранныеЗначения, ТекЭлементы.ПредставлениеЗначения);
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
	ТекущийЭлемент = ТекЭлементы.СписокВыбора;
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаУровеньВыше()
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	
	ВладелецНоменклатура = (ТипЗнч(ТекВладелец) = Тип("СправочникСсылка.НоменклатураКласса"));
	ТекЭлементы.СписокВыбора.ТекущаяСтрока = ?(ВладелецНоменклатура И ВыбранныеЗначения = 0, 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(ТекВладелец, "Класс"), ТекВладелец);
	
	СписокВыбора = Элементы.ВыбранныеЗначения.СписокВыбора;
	КолВо = СписокВыбора.Количество();
	Для Н = 1 По КолВо - ВыбранныеЗначения - 1 Цикл
		СписокВыбора.Удалить(КолВо - Н);
	КонецЦикла;
	
	СписокВыбора[ВыбранныеЗначения].Представление = ТекЭлементы.ПредставлениеЗначения;
	
	УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЭлементов(Элементы, ВыбранныеЗначения, КоличествоТипов)
	
	ЭлементыПоУровням = ПолучитьЭлементыПоУровням(Элементы);
	
	Для Каждого КлючИЗначение ИЗ ЭлементыПоУровням Цикл
		КлючИЗначение.Значение.КоманднаяПанель.Видимость = (КлючИЗначение.Ключ = ВыбранныеЗначения);
		КлючИЗначение.Значение.КоманднаяПанель.Доступность = (КлючИЗначение.Ключ = ВыбранныеЗначения);
	КонецЦикла;
	
	ТекЭлементы = ЭлементыПоУровням[ВыбранныеЗначения];
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекЭлементы.СтраницаФормы;
	Элементы.ФормаВыбратьЗначение.Заголовок = ТекЭлементы.ПредставлениеКнопкиВыбора;
	
	Элементы.ФормаЗавершитьВыбор.Видимость = (ВыбранныеЗначения < КоличествоТипов - 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЭлементыПоУровням(Элементы)
	
	ЭлементыПоУровням = Новый Соответствие;
	ЭлементыПоУровням.Вставить(0, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаКлассов, Элементы.ГруппаСписокКлассов,
		Элементы.СписокКлассов, НСтр("ru='Выбрать класс'"), НСтр("ru='(Выберите класс)'")));
	ЭлементыПоУровням.Вставить(1, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПолеОтбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаНоменклатуры, Элементы.ГруппаСписокНоменклатуры,
		Элементы.СписокНоменклатуры, "Класс", НСтр("ru='Выбрать номенклатуру'"), НСтр("ru='(Выберите номенклатуру)'")));
	ЭлементыПоУровням.Вставить(2, Новый Структура(
		"КоманднаяПанель, СтраницаФормы, СписокВыбора, ПолеОтбора, ПредставлениеКнопкиВыбора, ПредставлениеЗначения", 
		Элементы.ФормаКомандыСпискаОбъектовНоменклатуры, Элементы.ГруппаСписокОбъектов,
		Элементы.СписокОбъектовНоменклатуры, "НоменклатураКласса", НСтр("ru='Выбрать объект'"), НСтр("ru='(Выберите объект номенклатуры)'")));
	
	Возврат ЭлементыПоУровням;
	
КонецФункции

#КонецОбласти
